IDEA Connection Link
ConnectionLink.GetConnectionDataXML Method
[Missing <summary> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.GetConnectionDataXML(System.Guid)"]
 Namespace: IdeaRS.ConnectionLink
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public string GetConnectionDataXML(
	Guid connectionId
)
Public Function GetConnectionDataXML (
	connectionId As Guid
) As String
public:
String^ GetConnectionDataXML(
	Guid connectionId
)
Parameters
connectionId
Type: System.Guid
[Missing <param name="connectionId"/> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.GetConnectionDataXML(System.Guid)"]
Return Value
Type: String
[Missing <returns> documentation for "M:IdeaRS.ConnectionLink.ConnectionLink.GetConnectionDataXML(System.Guid)"]
See Also
Reference
ConnectionLink Class
IdeaRS.ConnectionLink Namespace